const questions = [
    // level 0 
    // index 1, 2, 3
    {
        index: 0,
        text: ' هل المشكلة التى تواجهك .....\n- قبل تشغيل المحرك "مشكلة عامة أو قياسات" \n- اثناء تشغيل المحرك "فشل فى تشغيل المحرك أو مشكلة تظهر بعد تشغيل المحرك" \n- اثناء القياده "السياره تتحرك" .',
        choices: [
            { text: 'قبل تشغيل المحرك "مشكلة عامة أو قياسات"', referToIndex: 1, statment: null },
            { text: 'اثناء تشغيل المحرك "فشل فى تشغيل المحرك أو مشكلة تظهر بعد تشغيل المحرك"', referToIndex: 2, statment: null },
            { text: 'اثناء القياده "السياره تتحرك"', referToIndex: 3, statment: null },
        ]
    },
    // level one Before - index 4, 5, 6, 7
    {
        index: 1,
        text: 'إليك بعض الخيارات المتاحة ....\n- القياسات اليومية الضرورية\n- لون زيت المحرك\n- إستهلاك السيارة للوقود ، زيت المحرك أو مياه الردياتير\n- إنخفاض مستوى السيارة\n- مشكلة فى الإضاءة',
        choices: [
            { text: 'القياسات اليومية الضرورية', referToIndex: 4, statment: null },
            { text: 'لون زيت المحرك', referToIndex: null, statment: 'بعض سائقي السيارات يفرح ويتباهى أمام زملائه السائقين أن زيت محرك سيارته مازال لونه لم يتغير بعد وضعه في محركه وتشغيل السيارة عدة كيلو مترات، والحقيقة أن من بعض وظائف زيت التزييت في المحركات هو تنظيف المحرك من نواتج احتكاك الأجزاء المتحركة داخله، لهذا فلابد وأن يتغير لونه دليل على أنه يقوم بوظيفته كما ينبغي، أما إن لم يتغير لونه بعد عدة كيلو مترات فهذا دليل على أن الزيت المستخدم لم يقوم بوظيفته وترك الرواسب' },
            { text: 'إستهلاك السيارة للوقود ، زيت المحرك أو مياه الردياتير', referToIndex: 5, statment: null },
            { text: 'إنخفاض مستوى السيارة', referToIndex: 6, statment: null },
            { text: 'مشكلة فى الإضاءة', referToIndex: 7, statment: null },
        ]
    },
    // level one during - index 8, 9, 10, 11, 12
    {
        index: 2,
        text: 'إليك بعض الخيارات المتاحة ....\n- صعوبه فى تشغيل المحرك\n- خروج دخان او ماء من الشاكمان اثناء  تشغيل المحرك\n- صدور صوت من جهة المحرك\n- نور التحذير الخاص بالزيت\n- شيء اخر',
        choices: [
            { text: 'صعوبه فى تشغيل المحرك', referToIndex: 8, statment: null },
            { text: 'خروج دخان او ماء من الشاكمان اثناء  تشغيل المحرك', referToIndex: 9, statment: null },
            { text: 'صدور صوت من جهة المحرك', referToIndex: 10, statment: null },
            { text: 'نور التحذير الخاص بالزيت', referToIndex: 11, statment: null },
            { text: 'شيء اخر', referToIndex: 12, statment: null },
        ]
    },
    // level onde during - index 17, 18, 19, 20
    {
        index: 3,
        text: 'إليك بعض الخيارات المتاحة ....\n- مشاكل فى الفرامل اثناء القيادة\n- مشاكل فى الفتيس اثناء القيادة\n- مشاكل فى الدبرياج اثناء القيادة',
        choices: [
            { text: 'مشاكل فى الفرامل اثناء القيادة', referToIndex: 17, statment: null },
            { text: 'مشاكل فى الفتيس اثناء القيادة', referToIndex: 18, statment: null },
            { text: 'مشاكل فى الدبرياج اثناء القيادة', referToIndex: 19, statment: null },
            { text: 'شيء اخر', referToIndex: 20, statment: null },
        ]
    },
    // level two
    {
        index: 4,
        text: 'الاقتراحات المتاحة ....\n- قياس مستوى زيت المحرك\n- قياس ضغط هواء الإطارات\n- قياس مستوى زيت الفرامل',
        choices: [
            { text: 'قياس مستوى زيت المحرك', referToIndex: null, statment: 'عند قياس مستوى منسوب زيت محرك السيارة، يجب أولاً أن تكون السيارة في مستوى أفقي، وأن يتم تشغيل المحرك حتى درجة حرارة تشغيله العادية، وبعد ذلك يوقف تشغيل المحرك والانتظار حوالي خمس دقائق، ثم يرفع مقياس الزيتمن مكانه بالمحرك و ينظف جيداً بقطعة قماش لا تحتوي على وبر،ثم يوضع مكانه مرة أخرى بالمحرك ويرفع ويلاحظ مستوى الزيت، ويجب أن يكون بين العلامتين بالمقاس ولا يكون أعلى من العلامة العلي أو أقل من العلامة السفلي، ولا يجب قياس مستوى الزيت والمحرك في حالة دوران لأن ذلك سيعطي بيان غير مضبوط لمنسوب الزيت بالمحرك' },
            { text: 'قياس ضغط هواء الإطارات', referToIndex: null, statment: 'عند قياس ضغط هواء الإطارات يجب أن يكون الإطار بارد، لأن قياس الضغط بعد مشوار طويل بالسيارة يعمل الاحتكاك بين إطار السيارة وبين الطريق على زيادة سخونة الإطارات وبالتالي زيادة سخونة الهواء بداخلها فيرتفع ضغطه، ويعطي بعد ذلك قراءة غير صحيحة لقيمة الضغط الفعلية داخل الإطارات' },
            { text: 'قياس مستوى زيت الفرامل', referToIndex: null, statment: 'عدم تزويد زيت الفرامل عند انخفاض منسوبه في علبة زيت الفرامل، لأن انخفاض منسوب سائل الفرامل يدل على تآكل فحمات الفرامل ( الأقمشة ) ويعطي الفرصة للمبة الفرامل أن تضيء في التابلوه، أما عند تزويد سائل الفرامل يتسبب في عدم اعطاء المؤشر او اللمبة فرصة لأن تضيء. ويتم تزويد سائل الفرامل فقط عند تسربه أو عند تغير أي من الأجزاء داخلية بالدورة.' },
        ]
    },
    {
        index: 5,
        text: 'الاقتراحات المتاحة ....\n-  الردياتير يحتاج تزويد مياه باستمرار\n- السيارة تستهلك وقود زيادة عن المعدل\n- المحرك يحتاج إضافة زيت باستمرار',
        choices: [
            { text: 'الردياتير يحتاج تزويد مياه باستمرار', referToIndex: null, statment: 'أختبر الوصلات الكاوتش وغير التالف منها أو الجوان التالف أو إلحم الردياتير إذا لزم الأمر . تسرب مياه من الردياتير ويدل على مكانها وجود ترسيبات من الصدأ\nتختبر قوام الزيت ولونه داخل الكرتير فإن بدا مثل قوام " الطحينة " دل على تلف الجوان ويتم تغييره .' },
            { text: 'السيارة تستهلك وقود زيادة عن المعدل', referToIndex: null, statment: 'الكربراتير يحتاج إلى ضبط، غير عضو الترشيح في فلتر الهواء وجود اختناق في مدخل الهواء' },
            { text: 'المحرك يحتاج إضافة زيت باستمرار', referToIndex: null, statment: 'اختبر سلامة عمل الخانق وصلابته صمام الخانق معلق على وضع شبه مقفول، نظف الكربراتير واختبر سلامة الوقود الوقود شحيح أو وجود ماء على البنزين، احكم رباط الفرن وتوصيلاته تسرب الهواء في فرن الحر.' },
        ]
    },
    {
        index: 6,
        text: 'الاقتراحات المتاحة ....\n- رفع مستوى السيارة على الأرض\n- السيارة منخفضة من الأمام',
        choices: [
            { text: 'رفع مستوى السيارة على الأرض', referToIndex: null, statment: 'إن كنت تشتكي من انخفاض مستوى السيارة على الأرض، مع التأكد من سلامة المساعدات والسوست او اليايات فأتجه فوراً إلى إحدى المراكز المتخصصة المعتمدة وأسأل عن إمكانية رفع مستوى السيارة عن الأرض، ولا تأخذ بنصيحة أحد بوضع عليَّات أو كعكات على السوستمن أسفل ومن أعلى، لأنها فعلاً سترفع من مستوى السيارة عن الأرض ولكنها ستؤدي إلى تلف المساعدات وتسبب خشونة في المطبات أثناء السير.' },
            { text: 'السيارة منخفضة من الأمام', referToIndex: null, statment: 'اضبط نفخ الاطارات، كسر أحد اليايات، ضعف أحد اليايات، ضعف مساعد السوستة الأمامي.' },
        ]
    },
    {
        index: 7,
        text: 'الاقتراحات المتاحة ....\n- مصابيح السيارة المتصلة بمفتاح الأنوار الرئيسي لا تضئ مع المفتاح\n- عدم إضاءة جميع مصابيح السيارة\n- ضعف أستضاءة أحد اوزوج الفوانيس الأمامية\n- جانب واحد من المصابيح الخلفية والجانبية لا يعمل مع صلاحية الإشارة ونور تحذير الفرامل',
        choices: [
            { text: 'مصابيح السيارة المتصلة بمفتاح الأنوار الرئيسي لا تضئ مع المفتاح', referToIndex: null, statment: 'استخدام كوبري بين طرفي المفتاح إذا أضاءت المصابيح غير المفتاح إذا لم تضئ افحص المنصهر أو غير المصابيح التالفة تلف مفتاح الأنوار الرئيسي، اعمل توصيلة أرضي منفصلة مؤقتة للاختبار ونظف مكان توصيل الأرضي جيداً رداءة توصيل الأرضي، اختبر المفتاح كما سبق وغيره إذا لزم الأمر تلف المفتاح، تتبع الاسلاك الموصلة وغير التالف منها تلف أو قطع سلك التوصيل لهذه المصابيح، غير المصابيح التالفة تلف المصابيح ذاتها.' },
            { text: 'عدم إضاءة جميع مصابيح السيارة', referToIndex: null, statment: 'نظف أقطاب البطارية وأعد ربطها، رداءة التوصيل بالبطارية، ختبر وأحكم رباط الوصلات غير المحكمة، غير أو أعد شحن البطارية، تلف البطارية تماماً أو فراغها تماماً.' },
            { text: 'ضعف أستضاءة أحد اوزوج الفوانيس الأمامية', referToIndex: null, statment: 'اشحن أو غير البطارية، أعد شد سير المروحة ، وجود عيب في توصيلات الأسلاك.' },
            { text: 'جانب واحد من المصابيح الخلفية والجانبية لا يعمل مع صلاحية الإشارة ونور تحذير الفرامل', referToIndex: null, statment: 'تلف المنصهر الخاص بالمصباح أو الجهاز التكميلي،  تلف المعدة التكميلية ذاتها، صلح أو غير المفتاح التالف.' },
        ]
    },
    //////////////////////////////////////////////////////////////////////////////////////////////////
    {
        index: 8,
        text: 'الاقتراحات المتاحة ....\n- المحرك لا يدور عند إدارة المفتاح\n- المحرك يدور ببطء ولكن لا يبدأ الحركة\n- المحرك يدور بطريقة عادية ولكن لا يبدأ في الاشعال',
        choices: [
            { text: 'المحرك لا يدور عند إدارة المفتاح', referToIndex: null, statment: 'السبب قد يكون ضعف البطارية أو تلفها "اشحن البطارية أو غيرها"، رداءة توصيل كابلات البطارية "نظف أقطاب البطارية أو غير الكابلات"، احتمال وجود ماء داخل السلندرات أو حشر المكابس "لابد من اللجوء لميكانيكي متخصص للكشف والإصلاح".' },
            { text: 'المحرك يدور ببطء ولكن لا يبدأ الحركة', referToIndex: null, statment: 'السبب قد يكون ضعف البطارية أو تلفها "اشحن البطارية أو غيرها"، سوء التوصيلات أو تآكل الكابلات الرئيسية "غير الكابلات التالفة أو أعد إحكام الوصلات"، عدم تلامس الكابل الأرضي مع الهيكل جيداً "نظف مكان الوصلة جيداً واحكم الربط"، عيب في المارش "يزال العيب أو يستبدل المارش"، زيادة لزوجة الزيت في كرتير الزيت "يفرغ الزيت ويعاد الملء بزيت ذو لزوجة مناسبة".' },
            { text: 'المحرك يدور بطريقة عادية ولكن لا يبدأ في الاشعال ', referToIndex: null, statment: 'اختبر وجود الكهرباء في سلك البوجيهات إذا تأكد وجود عيب في دورة الاشعال فقد يكون هناك عدم وجود كهرباء في أسلاك البوجيهات، اختبر الكهرباء القادمة من البوبينة واختبر الأسلاك الموصلة للبوبينة واختبر غطاء الاسبراتير من حيث الشروخ أو الرطوبة واختبر أيضاً الأبلاتين وتأكد من عدم وجود قصور في أي منها أو فصل في أي منها عدم وجود كهرباء في سلك التوصيل من الاسبرتير للبوجيه، انزع فلتر الهواء وراقب سلامة عمل بوابات الكربراتير وتأكد من أنه يقوم برش البنزين عند ضغط دواسة البنزين عند وجود كهرباء في اسلاك البوجيهات ويدل على ذلك حدوث شرارة بين أي سلك من أسلاك البوجيهات عند تقريب طرفه من جسم المحرك لمسافة 5 - 10 م وإدارة المارش.' },
        ]
    },
    {
        index: 9,
        text: 'الاقتراحات المتاحة ....\n- اللون الخارج من عادم المحرك او الشكمان\n- تساقط مياه من الشكمان عند بدء الادارة في الجو البارد',
        choices: [
            { text: 'اللون الخارج من عادم المحرك او الشكمان', referToIndex: null, statment: 'في ظروف التشغيل العادية المفروض أن غازات العادم تخرج من الشكمان بدون لون، ولكن هناك ثلاثة أنواع من غازات العادم تخرج من شكمان السيارة في حالات معينة كل منها له لون مختلف عن الآخر، ومن خلاله يمكن تشخيص حالة المحرك:\nإذا كان لون العادم ((أبيض مستمر))مع حالات التشغيل العادية وفي جميع الظروف، فهذا دليل على أن هناك تسرب لمياه التبريد إلى غرفة الاحتراق وتخترق معه\nوإذا كان لون العادم ((اسود او رمادي اقرب للسواد)) فهذا دليل على احتراق كمية كبيرة من الوقود في غرفة الاحتراق مما يدل علىاحتياج الكرباريتر او البخاخات للضبط ً (ضبط الوقود مع الهواء)\nوإذا كان لون العادم ((أزرق سماوي))فذلك دليل على أن هناك احتراق لزيت التزييت في غرفة الاحتراق، وهو دل على احتياجالمحرك للإصلاح.' },
            { text: 'تساقط مياه من الشكمان عند بدء الادارة في الجو البارد', referToIndex: null, statment: 'لا يدل ذلك على عيب في المحرك وانما يعد ذلك دليلاً على إحكام المحرك، قد يكون تلف جوان كتلة الاسطوانات "غير جوان كتله الاسطوانات"، وجود شرخ بغطاء كتلة الاسطوانات أو عدم استواء سطحه الأسفل "يتم كشط غطاء كتلة الاسطوانات"' },
        ]
    },
    {
        index: 10,
        text: 'الاقتراحات المتاحة ....\n- سماع صوت خشن وعالي بعد بدء الادارة\n- صوت نقر ضعيف في أعلى المحرك\n- صوت تنفيس من المحرك\n- أسباب سماع طقطقة في دورات المحرك\n- صدور أصوات من الدينامو',
        choices: [
            { text: 'سماع صوت خشن وعالي بعد بدء الادارة', referToIndex: null, statment: 'شحم طلمبة المياه وإذا كانت من النوع الذي لا يمكن تشحيمه أضف الإضافات المذكورة في كتالوج العربة والتي تساعد على تشحيم المحاور تلقائياً' },
            { text: 'صوت نقر ضعيف في أعلى المحرك', referToIndex: null, statment: 'قد يكون السبب عدم ضبط خلوصات التاكيهات "اضبط التاكيهات"، إذا استمر صوت النقر حتى بعد ضبط الخلوص أعهد بالسيارة إلى ورشة متخصصة لوجود تآكل في الكامات أو دليل الكامات أو الأذرع المتأرجحه' },
            { text: 'صوت تنفيس من المحرك', referToIndex: null, statment: 'تسرب غازات الشكمان من الفلانشة العلوية من فرن الشكان أعد رباط الشكمان أو غيره إذا لزم الأمر' },
            { text: 'أسباب سماع طقطقة في دورات المحرك', referToIndex: null, statment: 'مشكلة في الصمامات (Les Soupapes) الخاصة بالعادم أو بإدخال الهواء، و عادة ما تتسبب في سماع صوت طقطقة مسموعة. كما يمكن أن يكون المشكلة أيضآ من الغماز الهيدروليكي (Poussoir hydraulique) و هذه الأخيرة دورها هو الموافقة بين أعمدة الكامات (Arbres à cames) و الصمامات، إذ تضغط أعمدة الكامات على الغماز الهيدروليكي و الذي بدوره يضغط على الصمام لكي يفتح. عادة تطلق الغمازات أصوات طقطقة عندما يكون المحرك في حالة باردة أي في الصباح الباكر مثلآ، لكن إن كان الصوت مستمر حتى بعد تسخين المحرك، فالمشكلة راجع من الغمازات.' },
            { text: 'صدور أصوات من الدينامو', referToIndex: null, statment: 'السبب قد يكون عدم احكام ربط الدينامو في الجسم أو طارة الدينامو "اختبر تربيط الدينامو والطارة واحكم الرباط"، تآكل رولمان بلي الدينامو"غير رولمان البلي التالف"، في حالة وجود مولد ذو تيار متردد فإن أي خطأ في الشحن يؤدي لتلف المولد بسهولة لذا فإن أي عطل خارج عن عدم شد سير الدينامو أو فك أحد التوصيلات الخارجية أو قطع سير الدينامو يجب أن يعهـد بهــا لورشة متخصصة ' },
        ]
    },
    {
        index: 11,
        text: 'الاقتراحات المتاحة ....\n- نور التحذير الخاص بالزيت لا ينطفئ مع إدارة المحرك\n- نور التحذير للزيت يظهر عند الدوران بالسيارة ، نور التحذير بنطفئ فقط عند زيادة سرعة دوران المحرك',
        choices: [
            { text: 'نور التحذير الخاص بالزيت لا ينطفئ مع إدارة المحرك', referToIndex: null, statment: 'نقص الزيت بالمحرك "أختبر مستوى الزيت في المحرك"،  تلف مبين ضغط الزيت نفسه "استبدل مبين ضغط الزيت"، ويمكن اختبار سلامة التوصيل بنزع سلك الوحدة فإذا انطفأ النور التحذيري دل ذلك على تلف وحدة الارسال نفسها ويجب تغييرها وإذا لم يطفأ النور دل ذلك على عدم سلامة التوصيلات الكهربية تلف وحدة الارسال الموجودة بالمحرك يجب أن يعهد بالسيارة إلى ورشة متخصصة وجود عيب في دورة الزيت.' },
            { text: 'نور التحذير للزيت يظهر عند الدوران بالسيارة ، نور التحذير بنطفئ فقط عند زيادة سرعة دوران المحرك', referToIndex: null, statment: 'نقص مستوى الزيت بالكرتير "أكمل مستوى الزيت"، إذا كان الزيت المستخدم زيت مناسب فلا بد من اللجوء لورشة متخصصة قلة ضغط الزيت عند السرعات البطيئة.' },
        ]
    },
    // index 13
    {
        index: 12,
        text: 'الاقتراحات المتاحة ....\n- المحرك لا تصل درجة حرارته لدرجة الحرارة العادية\n- المحرك يدور ولكن العربة لا تتحرك بعد تمام التعشيق\n- أنوار لوحة العداد لا تعمل\n- شيء اخر',
        choices: [
            { text: 'المحرك لا تصل درجة حرارته لدرجة الحرارة العادية', referToIndex: null, statment: 'عدم ضبط الترمستات أو عدم توافقه مع مدى درجة الحرارة المطلوبة للمحرك "غير الترموستات بآخر له المواصفات الصحيحة", تلف وحدة الاحساس بالحرارة الموجودة بالردياتير "غير عضو الاحساس بالحرارة بآخر سليم", عداد الحرارة أو مبينة الحرارة في السيارة "غير المبينة بأخرى سليمة". ' },
            { text: 'المحرك يدور ولكن العربة لا تتحرك بعد تمام التعشيق', referToIndex: null, statment: 'أعهد بالسيارة لورشة متخصصة كسر عمود الكردان أو عامود " الكوبلن " في حالة الجر الامامي، أعهد بالسيارة لورشة متخصصة عطل في الدفرنسيل الخلفي، اختبر المشوار الحر للدبرياج أو ألجأ لورشة متخصصة للاصلاح عطل بالدبرياج أو كسر الأسطوانة.' },
            { text: 'أنوار لوحة العداد لا تعمل', referToIndex: null, statment: 'قد يكون السبب ناتج عن وجود رخاوة في اتصال الفيش الخاصة بالطبلون والفيش المتصلة بقاعدة الفيوزات والريليات , مع فحص اي سويتش متعلق بالطبلون مثل سويتش تحديد قوة اضاءة الطبلون , والتاكد من عدم وجود التماس في ظفيرة السيارة وفحص تأريض السيارة بشكل جيد' },
            { text: 'شيء اخر', referToIndex: 13, statment: null },
        ]
    },
    // index 14
    {
        index: 13,
        text: 'الاقتراحات المتاحة ....\n- نور دورة الاشعال " الدينامو " يبقى بعد دوران المحرك\n- تذبذب شحن الدينامو\n- عدم شحن البطارية\n- شيء اخر',
        choices: [
            { text: 'نور دورة الاشعال " الدينامو " يبقى بعد دوران المحرك', referToIndex: null, statment: 'قطع سير الدينامو "غير السير"، اختبر سلامة عمل الدينامو لدى ورشة متخصصة عدم وجود خرج من الدينامو' },
            { text: 'تذبذب شحن الدينامو', referToIndex: null, statment: 'تأكد من جودة توصيل أرضي الكتاوت، غير أو أعد ضبط كتاوت الدينامو، عيب في كتاوت الدينامو أو ضعف توصيل الأرضي ويظهر ذلك في تذبذب استضاءة الأنوار أو تذبذب مؤشر مبين الشحن.' },
            { text: 'عدم شحن البطارية', referToIndex: null, statment: 'انزع الفرش وغير التالف منه ، أو نظفها وأعد تركيبها حشر الفرش بالمولد إذا دل لون الياي على زيادة سخونته غير الياي ضعف ياي الضغط على الفرش نظف بقطعة قماش مبللة بالبنزين اى قذارة أو رواسب على مجمع الدينامو " الكلكتور "، أعهد به لكهربائي متخصص لإصلاح عطل وجود عطل في أسلاك الدينامو الداخلية .' },
            { text: 'شيء اخر', referToIndex: 14, statment: null },
        ]
    },
    // index 15, 16
    {
        index: 14,
        text: 'الاقتراحات المتاحة ....\n- انزلاق الدبرياج\n- إنخفاض مستوى السيارة\n- مشكلة فى الإضاءة\n- شيء اخر',
        choices: [
            { text: 'انزلاق الدبرياج', referToIndex: null, statment: 'عدم ضبط المشوار للدبرياج "أعد ضبط مشوار الدبرياج"، وجود زيت أو شحم في الاسطوانة "غير الاسطوانة أو ابحث عن مصدر الزيت وأمنعه"، تآكل اسطوانة الدبرياج "غير الاسطوانة". ' },
            { text: 'إنخفاض مستوى السيارة', referToIndex: 15, statment: null },
            { text: 'مشكلة فى الإضاءة', referToIndex: 16, statment: null },
            { text: 'شيء اخر', referToIndex: null, statment: 'عفوا لم نستطع تحديد المشكلة' },
        ]
    },
    {
        index: 15,
        text: 'الاقتراحات المتاحة ....\n- رفع مستوى السيارة على الأرض\n- السيارة منخفضة من الأمام',
        choices: [
            { text: 'رفع مستوى السيارة على الأرض', referToIndex: null, statment: 'إن كنت تشتكي من انخفاض مستوى السيارة على الأرض، مع التأكد من سلامة المساعدات والسوست او اليايات فأتجه فوراً إلى إحدى المراكز المتخصصة المعتمدة وأسأل عن إمكانية رفع مستوى السيارة عن الأرض، ولا تأخذ بنصيحة أحد بوضع عليَّات أو كعكات على السوستمن أسفل ومن أعلى، لأنها فعلاً سترفع من مستوى السيارة عن الأرض ولكنها ستؤدي إلى تلف المساعدات وتسبب خشونة في المطبات أثناء السير.' },
            { text: 'السيارة منخفضة من الأمام', referToIndex: null, statment: 'اضبط نفخ الاطارات، كسر أحد اليايات، ضعف أحد اليايات، ضعف مساعد السوستة الأمامي.' },
        ]
    },
    {
        index: 16,
        text: 'الاقتراحات المتاحة ....\n- مصابيح السيارة المتصلة بمفتاح الأنوار الرئيسي لا تضئ مع المفتاح\n- عدم إضاءة جميع مصابيح السيارة\n- ضعف أستضاءة أحد اوزوج الفوانيس الأمامية\n- جانب واحد من المصابيح الخلفية والجانبية لا يعمل مع صلاحية الإشارة ونور تحذير الفرامل',
        choices: [
            { text: 'مصابيح السيارة المتصلة بمفتاح الأنوار الرئيسي لا تضئ مع المفتاح', referToIndex: null, statment: 'استخدام كوبري بين طرفي المفتاح إذا أضاءت المصابيح غير المفتاح إذا لم تضئ افحص المنصهر أو غير المصابيح التالفة تلف مفتاح الأنوار الرئيسي، اعمل توصيلة أرضي منفصلة مؤقتة للاختبار ونظف مكان توصيل الأرضي جيداً رداءة توصيل الأرضي، اختبر المفتاح كما سبق وغيره إذا لزم الأمر تلف المفتاح، تتبع الاسلاك الموصلة وغير التالف منها تلف أو قطع سلك التوصيل لهذه المصابيح، غير المصابيح التالفة تلف المصابيح ذاتها.' },
            { text: 'عدم إضاءة جميع مصابيح السيارة', referToIndex: null, statment: 'نظف أقطاب البطارية وأعد ربطها، رداءة التوصيل بالبطارية، اختبر وأحكم رباط الوصلات غير المحكمة، غير أو أعد شحن البطارية، تلف البطارية تماماً أو فراغها تماماً.' },
            { text: 'ضعف أستضاءة أحد اوزوج الفوانيس الأمامية', referToIndex: null, statment: 'اشحن أو غير البطارية، أعد شد سير المروحة ، وجود عيب في توصيلات الأسلاك.' },
            { text: 'جانب واحد من المصابيح الخلفية والجانبية لا يعمل مع صلاحية الإشارة ونور تحذير الفرامل', referToIndex: null, statment: 'تلف المنصهر الخاص بالمصباح أو الجهاز التكميلي،  تلف المعدة التكميلية ذاتها، صلح أو غير المفتاح التالف.' },
        ]
    },
    //////////////////////////////////////////////////////////////////////////////////////////////////
    // index 21
    {
        index: 17,
        text: 'الاقتراحات المتاحة ....\n- صفير الفرامل\n- تحديد صوت صفير الفرامل\n- السيارة لا تستجيب للفرامل',
        choices: [
            { text: 'صفير الفرامل', referToIndex: null, statment: 'إذا استمعت إلى صوت صفير أثناء القيادة وخاصة استخدام الفرامل أو شممت رائحة احتراق، فهذا إشارة واضحة إلى ضرورة تغيير الـ “سفايف” (تيل الفرامل). أما إذا صاحب الصفير صوت مزعج مع اهتزاز أسفل السيارة، فهذا يعني ضرورة تغيير الـ “ديسك” (الطنابير)، يمكنك تجنب ذلك إذا قمت بتغيير الـ “سفايف” بصورة دورية.' },
            { text: 'تحديد صوت صفير الفرامل', referToIndex: null, statment: 'عند سماع صوت صفارة عندالضغط على الفرامل، ولا تستطيع تحديد مصدر الصوت، هل هو من الفرامل الأمامية؟ أم الخلفية؟ قم بقيادة السيارة على سرعة متوسطة، ثم أجعل صندوق التروس في وضع الحياد أو N ، وأرفع فرملة اليد تدريجياً وبشكل بسيط جدا أثناء القيادة، فإذا صدر الصوت فهو من الفرامل الخلفية وإن لم يصدر فهو من الفرامل الأمامية.' },
            { text: 'السيارة لا تستجيب للفرامل', referToIndex: null, statment: 'إذا كانت سيارتك لا تقف عند استخدام الفرامل وتستمر في السير البطيء أو الزحف، فأنت بحاجة إلى ضبط الفرامل لدى مركز الصيانة من خلال سحب هواء الفرامل والتأكد من سلامة “سفايف” الفرامل ومنسوب الزيت الخاص بها.' },
            { text: 'شيء اخر', referToIndex: 21, statment: null },
        ]
    },
    {
        index: 18,
        text: 'الاقتراحات المتاحة ....\n- صعوبة في تعشيق السرعات\n- صدور أصوات خلال التعشيق للسرعات المختلفة\n- وجود صعوبة في فك التعشيقات في الجيربوكس',
        choices: [
            { text: 'صعوبة في تعشيق السرعات', referToIndex: null, statment: 'الدبرياج لا يفصل تماماً "اضبط المشوار الحر للدبرياج"، كسر أو تلف الاسطوانة "يجب تغيير اسطوانة الدبرياج"، التصاق الاسطوانة بالقرص الضاغط خاصة بعد التخزين لمدة طويلة "ادفع العجلة الأمامية في حالة الجر الأمامي أو الخلفية في حالة الجر الخلفي وأدر المحرك ثم استعمل بدال الدبرياج مع التعشيق أو استخدم الفرامل حتى يفك الالتصاق فإذا لم يفك لابد من فك الدسك والأسطوانة". ' },
            { text: 'صدور أصوات خلال التعشيق للسرعات المختلفة', referToIndex: null, statment: 'تآكل غوايش التروس او تآكل رولمان بلي صندوق التروس او عدم سلامة عمل الدبرياج "أعهد بالسيارة إلى ورشة متخصصة" .' },
            { text: 'وجود صعوبة في فك التعشيقات في الجيربوكس', referToIndex: null, statment: 'عدم ضبط مستوى الزيت في الجيربوكس "املأ الجيربوكس بالزيت حسب المستوى الصحيح". ' },
        ]
    },
    {
        index: 19,
        text: 'الاقتراحات المتاحة ....\n- انزلاق الدبرياج\n- وجود رعشة بالدبرياج\n- وجود صوت عند ضغط بدال الدبرياج\n- بدال الدبرياج لا يعود لوضعه الأصلي بعد الوصل',
        choices: [
            { text: 'انزلاق الدبرياج', referToIndex: null, statment: 'عدم ضبط المشوار للدبرياج "أعد ضبط مشوار الدبرياج"، وجود زيت أو شحم في الاسطوانة "غير الاسطوانة أو ابحث عن مصدر الزيت وأمنعه"، تآكل اسطوانة الدبرياج "غير الاسطوانة". ' },
            { text: 'وجود رعشة بالدبرياج', referToIndex: null, statment: 'عدم ضبط الدسك "غير الديسك"، عدم صلاحية قواعد تثبت المحرك "غير قواعد تثبت المحرك"، تلف صرة الاسطوانة "غير الاسطوانة التالفة". ' },
            { text: 'وجود صوت عند ضغط بدال الدبرياج', referToIndex: null, statment: 'عدم ضبط مشوار البدال"أعد ضبط مشوار الدبرياج"، تلف رولمان بلي الدبرياج "غير رولمان بلي الدبرياج". ' },
            { text: 'بدال الدبرياج لا يعود لوضعه الأصلي بعد الوصل', referToIndex: null, statment: 'عيب في وصلات الدبرياج "اضبط وصلات وخلوصات البدال"، أعد ضبط السرعة البطيئة.' },
        ]
    },
    // index 23, 24, 30, 31
    {
        index: 20,
        text: 'الاقتراحات المتاحة ....\n- مشاكل فى نظام التعليق اثناء القيادة\n- مشاكل فى أداء المحرك اثناء القيادة',
        choices: [
            { text: 'مشاكل فى نظام التعليق اثناء القيادة', referToIndex: 23, statment: null },
            { text: 'مشاكل فى أداء المحرك اثناء القيادة', referToIndex: 24, statment: null },
            { text: 'أرتفاع / أنخفاض درجة حرارة المحرك', referToIndex: 30, statment: null }, //
            { text: 'شيء اخر', referToIndex: 31, statment: null }, //
        ]
    },
    // index 22
    {
        index: 21,
        text: 'الاقتراحات المتاحة ....\n- وجود ارتعاش عند فرملة السيارة\n- انحراف السيارة لأحد الاتجاهين عند فرملتها\n- السيارة لا تقف إلا بعد ضغط بدال الفرامل لمشوار طويل جداً',
        choices: [
            { text: 'وجود ارتعاش عند فرملة السيارة', referToIndex: null, statment: 'عدم إحكام ربط الأجزاء "أعد رباط الأجزاء"، تآكل طنابير العجلات "أعد خرط الطنابير أو غيرها"، تلف تيل الفرامل "غير تيل الفرامل". ' },
            { text: 'انحراف السيارة لأحد الاتجاهين عند فرملتها', referToIndex: null, statment: 'أحد الاطارات به ضغط أقل من الآخر "اضبط النفخ في الاطارات"، عدم ضبط الفرامل بالتساوي في الناحيتين اليمنى واليسرى "اضبط الفرامل بحيث يتم الايقاف في نفس الوقت في الناحيتين اليمنى واليسرى وبنفس القوة"،  وجود شحوم أو زيت على العجل من ناحية يسبب انزلاق التيل أو عدم فاعلية الفرامل "نظف الناحية التي بها شحوم"، حشر أو التصاق أحد الاسطوانات الفرعية مما يسبب عدم فاعلية فرملة العجلة عند فرملة السيارة "فك الاسطوانة وأزل سبب الحشر". ' },
            { text: 'السيارة لا تقف إلا بعد ضغط بدال الفرامل لمشوار طويل جداً', referToIndex: null, statment: 'عدم ضبط مشوار البدال وتيل الفرامل "اضبط مشوار تيل الفرامل وغير التيل إذا كان متآكلا". ' },
            { text: 'شيء اخر', referToIndex: 22, statment: null },
        ]
    },
    {
        index: 22,
        text: 'الاقتراحات المتاحة ....\n- البدال يحتاج لإعادة الضغط عدة مرات لظهور فاعلية الفرامل\n- سخونة طنابير العجل أو إنبعاث دخان من تيل الفرامل\n- هرب الفرامل بصورة مفاجئة',
        choices: [
            { text: 'البدال يحتاج لإعادة الضغط عدة مرات لظهور فاعلية الفرامل', referToIndex: null, statment: 'وجود هواء بدورة الفرامل "يستخرج الهواء من دورة الفرامل"، وجود عيب في ماستر الفرامل الرئسي "غير ماستر الفرامل"، وجود تسرب بسيط في الدورة "ابحث عن مكان التسرب وامنعه بإحكام التربيط". ' },
            { text: 'سخونة طنابير العجل أو إنبعاث دخان من تيل الفرامل', referToIndex: null, statment: 'التصاق التيل مع الطانبير "أعد ضبط التيل"، أوقف السيارة ودع الطنابير تبرد قبل بدء الحركة استخدام الفرامل بصورة مستمرة على المنحدرات أو خلال قطر السيارة.' },
            { text: 'هرب الفرامل بصورة مفاجئة', referToIndex: null, statment: 'أعهد بالسيارة إلى ورشة متخصصة لوجود كسر أو قطع بأحد مواسير الفرامل' },
        ]
    },
    {
        index: 23,
        text: 'الاقتراحات المتاحة ....\n- انحراف السيارة\n- خبط شديد أثناء قيادة السيارة\n- صوت طقه متكرره اثناء الدوران او الملفات\n- وجود ذبذبة في السيارة أثناء السير',
        choices: [
            { text: 'انحراف السيارة', referToIndex: null, statment: 'إذا شعرت بانحراف السيارة على السرعات المتوسطة وخلال استخدام الفرامل، فهذه إشارة إلى خلل في ضغط هواء الإطارات. عليك بفحص الإطارات، فربما تكون غير متوازنة. وتحتاج إطارات السيارة عادة إلى ضبط الزوايا لاستعادة توازنها، وذلك لسلامة القيادة والحد من تآكل الإطارات.' },
            { text: 'خبط شديد أثناء قيادة السيارة ', referToIndex: null, statment: 'زيادة نفخ الاطارات "اضبط النفخ في الاطارات"، السيارة محملة أكثر من اللازم أو الحمل غير موزع بإنتظام "لا تحمل أكثر من اللازم مع توزيع الحمل الموجود على السيارة"،  وجود بيضاوي في العجلات "غير الاطار غير المستدير"، عدم إحكام ربط مساعد سوستة أو تلف المساعد "أحكم ربط المساعد أو غيره"، كسر الياي "غير الياي المكسور"، حشر أو التصاق أجزاء التعليق "استخدم كوريك لرفع الجسم وفك الحشر الموجود بالتعليق". ' },
            { text: 'صوت طقه متكرره اثناء الدوران او الملفات', referToIndex: null, statment: ' تلف الوصلات المفصلية للعربات ذات الجر الأمامي (الكوبلن) "غير الوصلات المفصلية التالفة". ' },
            { text: 'وجود ذبذبة في السيارة أثناء السير', referToIndex: null, statment: 'عدم احكام ربط مسامير الاطارات جيداً "أعد احكام المسامير"، عدم اتزان العجلات ويظهر ذلك بظهور الذبذبات على سرعات معينة "أعد عملية ترصيص العجلات في ورشة متخصصة"،  وجود تلف بالاطار الكاوتشوك نفسه "غير الاطار التالف"،  تلف الوصلات المفصلية للعربات ذات الجر الأمامي (الكوبلن) "غير الوصلات المفصلية التالفة"، تلف رولمان بلي العجل "غير الرولمان بلي التالف".' },
        ]
    },
    // index 25
    {
        index: 24,
        text: 'الاقتراحات المتاحة ....\n- المحرك يبطل في السرعات البطيئة والمحرك بارد\n- المحرك يبطل في السرعات البطيئة حتى بعد التسخين\n- المحرك يبطل عند التعجيل\n- شيء اخر',
        choices: [
            { text: 'المحرك يبطل في السرعات البطيئة والمحرك بارد', referToIndex: null, statment: 'صمام الخانق (الشفاط) يحتاج ضبط "اضبط صمام الخانق (الشفاط)"، صمام الخانق (الشفاط) لا يعمل "أعد تشغيل وصلات التشغيل وغير التالف منها"، السرعة البطيئة مضبوطة على عدد لفات قليل جداً "يعاد ضبط عدد اللفات ليكون حوالي 700 لفة / دقيقة". ' },
            { text: 'المحرك يبطل في السرعات البطيئة حتى بعد التسخين', referToIndex: null, statment: 'عدم ضبط الهواء والبنزين بطريقة صحيحة "يعاد ضبط الهواء والبنزين للسرعة البطيئة"، سدد في " باك " نافورة السرعة البطيئة "نظف الباك النافورة جيداً"، زرجنة في صمام الخانق (الشفاط) "  تأكد من سلامة عمل الخانق (الشفاط) "، نقطة تلامس " الابلاتين " متآكلة أو غير مضبوطة "نظف وأعد ضبط خلوص نقط التلامس في الموزع"، طفح الكربراتير (الشرقان) "أعد ضبط مستوى البنزين في غرفة العوامة بضبط العوامة"، وجود تسرب في الخلخلة الناتجة عن حركة المكابس "تأكد من احكام ربط كل من الكربراتير وفرن الحر وكل التوصيلات الموصلة في فرن الحر". ' },
            { text: 'المحرك يبطل عند التعجيل', referToIndex: null, statment: 'طلمبة التعجيل بالكربراتير لا تعمل أو انها تعمل بكفاءة منخفضة "اختبر قوة تدفق البنزين لغرفة العوامة قبل الشروع في اصلاح طلمبة التعجيل في الكربراتير"، صمام الخانق لا يعمل جيداً أو أنه غير مضبوط  "اختبر عمل صمام الخانق وأصلح العيب"، عدم كفاية البنزين الواصل للكربراتير "نظف ابرة الكربراتير وقاعدة الأبرة ثم اختبر مستوى الوقود في غرفة العوامة"، وجود قصر في داخل الموزع يسببه جهاز التقديم الأتوماتيكي "اختبر اسلاك الموزع الداخلية وتأكد من عدم وجود اسلاك عارية ممكن أن تؤدي إلى عملية قصر الدائرة"، كثرة الرواسب في فلتر الهواء "نظف أو غير عنصر الترشيح في فلتر الهواء". ' },
            { text: 'شيء اخر', referToIndex: 25, statment: null },
        ]
    },
    // index 26
    {
        index: 25,
        text: 'الاقتراحات المتاحة ....\n- المحرك يبطل عند إيقاف السيارة ولكن يدور في الأحوال الأخرى\n- المحرك يعطس ويبطل\n- المحرك يعطس أو يحدث به باك فاير عند زيادة السرعة\n- شيء اخر',
        choices: [
            { text: 'المحرك يبطل عند إيقاف السيارة ولكن يدور في الأحوال الأخرى', referToIndex: null, statment: 'مسمار ضبط باب الكربراتير يحتاج إعادة ضبط "اضبط السرعة البطيئة بتزويد عدد اللفات"، انسداد فونية دخول الهواء "يتم تنظيف الفونية جيداً"، تسرب في طلمبة عن طريق فرن الحر "اختبر احكام ربط كل الأجزاء الموصلة لمدخل الهواء بما فيها ماسورة التقديم الاتوماتيكي"، زيادة سخونة المحرك "اختبر توقيت الاشعال ودورة التبريد وضبط الكربراتير وشد سير المروحة وكذلك الترموستات لمعرفة سبب زيادة سخونة المحرك"، زيادة سخونة شمعات الاحتراق البوجيهات "اختبر مدى مطابقة نوع البوجيه لمواصفات السيارة"، وجود نقطة كربونية ساخنة داخل غرفة الاشتعال "إزالة الشوائب الكربونية المترسبة داخل غرفة الاشعال"، اختلال ضبط خلوصات الصمامات في المحرك "أعد ضبط الخلوصات"، تسرب في الخلخلة داخل المحرك "أعد احكام ربط الوصلات الخاصة بدائرة الحر". ' },
            { text: 'المحرك يعطس ويبطل', referToIndex: null, statment: 'توقيت الشرارة بعيداً جداً عن التوقيت الصحيح او وجود عطل في جهاز التقديم الاتوماتيكي "أعد ملء التانك بالوقود المناسب الوقود المستعمل أعد ضبط توقيت الاشعال"، زيادة سخونة المحرك "اختبر اليايات والأثقال الخاصة بالطرد المركزي داخل الموزع "، زيادة السخونة في شمعات الاحتراق "اختبر شمعات الاحتراق"، زيادة الترسيبات داخل غرفة الاشتعال "ازل الرواسب الكربونية من داخل غرف الاشتعال واختبر دورة التبريد". ' },
            { text: 'المحرك يعطس أو يحدث به باك فاير عند زيادة السرعة', referToIndex: null, statment: 'صمام الخانق معلق على وضع شبه مقفول "اختبر سلامة عمل الخانق وصلابته", الوقود شحيح أو وجود ماء على البنزين "نظف الكربراتير واختبر سلامة الوقود", تسرب الهواء في فرن الحر "احكم رباط الفرن وتوصيلاته".' },
            { text: 'شيء اخر', referToIndex: 26, statment: null },
        ]
    },
    // index 27
    {
        index: 26,
        text: 'الاقتراحات المتاحة ....\n- يتوقف المحرك بشكل مفاجىء غير معتاد\n- عدم انتظام السرعة البطيئة للمحرك\n- المحرك لا يؤدي التعجيل المطلوب والمتناسب مع ضغط دواسة البنزين\n- شيء اخر',
        choices: [
            { text: 'يتوقف المحرك بشكل مفاجىء غير معتاد', referToIndex: null, statment: 'من اخطر سيور نقل الحركه فى المحرك هو سير الكاتينه وللاسف فأن انقطاعه ياتى بشكل مفاجىء ويسبب ذلك مشاكل جسيمه بالمحرك ولذلك لابد من سرعه معرفه انقطاعه عند حدوث ذلك ونتبع الاتى عند انقطاعه يتوقف المحرك بشكل مفاجىء غير معتاد ومن الممكن ان يتوقف المحرك لعده اسباب اخرى ولكن للامان يجب وضع سير الكاتينه اولا, اوقف السياره وارفع غطاء المحرك وقم باداره المحرك لمره واحده لعده ثوان مع التركيز فى صوت دوران المارش (الاستارتر) اذا وجدت ان الصوت مختلف والمارش يدور بسرعه عاليه غير معتاده فأن سير الكاتينه قد انقط فعلا وفى هذه الحاله لا تقم بأداره المحرك مره اخرى ولابد من سحب السياره لتغييره' },
            { text: 'عدم انتظام السرعة البطيئة للمحرك', referToIndex: null, statment: 'عدم ضبط السرعة ومخلوط الكربراتير "أعد ضبط المخلوط للسرعة البطيئة وأعد ضبط عدد اللفات للسرعة البطيئة", وجود تسريب في إحكام التفريغ الناتج عن حركة الاسطوانات مما يؤدي إلى دخول هواء عن طريق الكربراتير ونقل قوة المخلوط الداخل عدم ضبط خلوص قاطع تيار الموزع " الأبلاتين " أو تآكل طرفيه "أعد الضبط ", عدم ضبط خلوص شمعات الاحتراق البوجيهات "أعد ضبط خلوص شمعات الاحتراق أو غيرها إن لزم الأمر", عدم ضبط توقيت الاشتعال تماماً "أعد ضبط توقيت الاشتعال", اختبر احكام ربط الكربراتير وفرن الحر وتوصيلاته.' },
            { text: 'المحرك لا يؤدي التعجيل المطلوب والمتناسب مع ضغط دواسة البنزين', referToIndex: null, statment: 'عدم ضبط توقيت الاشتعال "أعد ضبط توقيت الاشتعال", تسرب في التفريغ الناتج داخل المحرك "أعد الأحكام وغير الجوانات التالفة", عدم كفاية كمية البنزين الداخلة "نظف ابرة الكربراتير والنافورات". ' },
            { text: 'شيء اخر', referToIndex: 27, statment: null },
        ]
    },
    // index 28
    {
        index: 27,
        text: 'الاقتراحات المتاحة ....\n- قلة القدرة الناتجة عن المحرك\n- المحرك يقطع مع السرعات العالية\n- المحرك به تقطيع وعدم انتظام\n- شيء اخر',
        choices: [
            { text: 'قلة القدرة الناتجة عن المحرك', referToIndex: null, statment: 'عدم ضبط توقيت الاشتعال "أختبر الدواسة وأن طول مشوار الدواسة متناسب مع طول مشوار بوابة الكربراتير", عدم ضبط مقدم الشرارة الأتوماتيكي "أعد ضبط واصلاح اللازم ", تسرب الخلخلة من المحرك "أختبر وأصلح سبب التسرب من فرن الحر أو الكربراتير", عدم ضبط خلوصات الصمامات "أعد ضبط الخلوصات", قلة الضغط داخل الأسطونات "اختبر ضغط المحرك ويرسل المحرك للعمرة إذا كانت حالته تحتاج إلى عمرة", قلة كمية الوقود الواصل إلى الكربراتير "أختبر طلمبة البنزين أو ابرة الكربراتير ثم نافورات الكربراتير", عدم ضبط الوصلات الميكانيكية من البدال إلى الكربراتير "أعد ضبط الوصلات ليتناسب مشوار الدواسة مع مشوار الباب في الكربراتير". ' },
            { text: 'المحرك يقطع مع السرعات العالية', referToIndex: null, statment: 'وجود اتساخ أو عدم احكام في الوصلات الكهربية في دورة الاشتعال "نظف واحكم الرباط", احتراق أو اتساخ نقطي التلامس في الموزع الأبلاتين "نظف أوغير الأبلاتين", تلف شمعات الاحتراق البوجيهات "غير البوجيهات", وجود شوائب في الكربراتير "نظف الكربراتير", عدم ضبط خلوصات الصمامات بالمحرك "اختبر وأعد ضبط خلوصات الصمامات", زيادة الشوائب في فلتر الهواء "نظف أو غير عضو الترشيح في فلتر الهواء". ' },
            { text: 'المحرك به تقطيع وعدم انتظام', referToIndex: null, statment: 'وجود مياه مع الوقود "تأكد من نظافة وعدم اختلاط الوقود الموجود بالتنك بأي مياه", عدم كفاية مستوى الوقود في الكربراتير "اضبط مستوى البنزين في غرفة العوامة بواسطة ضبط العوامة في الكربراتير", الوقود على وشك النفاذ من الخزان أو قلة الوقود الواصل للكربراتير "أعد ملء خزان السيارة واختبر فلتر الوقود ووصلات الوقود وسلامة عمل طلمبة الوقود". ' },
            { text: 'شيء اخر', referToIndex: 28, statment: null },
        ]
    },
    // index 29
    {
        index: 28,
        text: 'الاقتراحات المتاحة ....\n- رائحة بنزين اثناء السير\n- صدور صوت من جهة المحرك\n- اللون الخارج من عادم المحرك او الشكمان\n- شيء اخر',
        choices: [
            { text: 'رائحة بنزين اثناء السير', referToIndex: null, statment: 'عند وجود شكوى متكررة من شم رائحة بنزين أثناء السير بالسيارة. يجب التأكد أولاً من عدم وجود تسريب للبنزين من دورة الوقود، ثم التأكد من الضبط الصحيح للمحرك وخاصة على السرعات العالية، ثم عدم وجود تنفيس للعادم من الشكمان، ثم التأكد من الإحكام الجيد لهوايات الداخلية للشنطة الخلفية للسيارة أو انسداد بماسورة تهوية التانكي في بعض السيارات' },
            { text: 'صدور صوت من جهة المحرك', referToIndex: 29, statment: null },
            { text: 'اللون الخارج من عادم المحرك او الشكمان', referToIndex: null, statment: 'في ظروف التشغيل العادية المفروض أن غازات العادم تخرج من الشكمان بدون لون، ولكن هناك ثلاثة أنواع من غازات العادم تخرج من شكمان السيارة في حالات معينة كل منها له لون مختلف عن الآخر، ومن خلاله يمكن تشخيص حالة المحرك:\nإذا كان لون العادم ((أبيض مستمر))مع حالات التشغيل العادية وفي جميع الظروف، فهذا دليل على أن هناك تسرب لمياه التبريد إلى غرفة الاحتراق وتخترق معه\nوإذا كان لون العادم ((اسود او رمادي اقرب للسواد)) فهذا دليل على احتراق كمية كبيرة من الوقود في غرفة الاحتراق مما يدل علىاحتياج الكرباريتر او البخاخات للضبط ً (ضبط الوقود مع الهواء)\nوإذا كان لون العادم ((أزرق سماوي))فذلك دليل على أن هناك احتراق لزيت التزييت في غرفة الاحتراق، وهو دل على احتياجالمحرك للإصلاح.' },
            { text: 'شيء اخر', referToIndex: null, statment: 'عفوا لم نستطع تحديد المشكلة' },
        ]
    },
    {
        index: 29,
        text: 'الاقتراحات المتاحة ....\n- صوت نقر ضعيف في أعلى المحرك\n- صوت تنفيس من المحرك\n- أسباب سماع طقطقة في دورات المحرك\n- صدور أصوات من الدينامو',
        choices: [
            { text: 'صوت نقر ضعيف في أعلى المحرك', referToIndex: null, statment: 'قد يكون السبب عدم ضبط خلوصات التاكيهات "اضبط التاكيهات"، إذا استمر صوت النقر حتى بعد ضبط الخلوص أعهد بالسيارة إلى ورشة متخصصة لوجود تآكل في الكامات أو دليل الكامات أو الأذرع المتأرجحه' },
            { text: 'صوت تنفيس من المحرك', referToIndex: null, statment: 'تسرب غازات الشكمان من الفلانشة العلوية من فرن الشكان أعد رباط الشكمان أو غيره إذا لزم الأمر' },
            { text: 'أسباب سماع طقطقة في دورات المحرك', referToIndex: null, statment: 'مشكلة في الصمامات (Les Soupapes) الخاصة بالعادم أو بإدخال الهواء، و عادة ما تتسبب في سماع صوت طقطقة مسموعة. كما يمكن أن يكون المشكلة أيضآ من الغماز الهيدروليكي (Poussoir hydraulique) و هذه الأخيرة دورها هو الموافقة بين أعمدة الكامات (Arbres à cames) و الصمامات، إذ تضغط أعمدة الكامات على الغماز الهيدروليكي و الذي بدوره يضغط على الصمام لكي يفتح. عادة تطلق الغمازات أصوات طقطقة عندما يكون المحرك في حالة باردة أي في الصباح الباكر مثلآ، لكن إن كان الصوت مستمر حتى بعد تسخين المحرك، فالمشكلة راجع من الغمازات.' },
            { text: 'صدور أصوات من الدينامو', referToIndex: null, statment: 'السبب قد يكون عدم احكام ربط الدينامو في الجسم أو طارة الدينامو "اختبر تربيط الدينامو والطارة واحكم الرباط"، تآكل رولمان بلي الدينامو"غير رولمان البلي التالف"، في حالة وجود مولد ذو تيار متردد فإن أي خطأ في الشحن يؤدي لتلف المولد بسهولة لذا فإن أي عطل خارج عن عدم شد سير الدينامو أو فك أحد التوصيلات الخارجية أو قطع سير الدينامو يجب أن يعهـد بهــا لورشة متخصصة ' },
        ]
    },
    {
        index: 30,
        text: 'الاقتراحات المتاحة ....\n- ارتفاع درجة حرارة المحرك\n- المحرك لا تصل درجة حرارته لدرجة الحرارة العادية\n- المحرك يسخن بطريقة غير عادية',
        choices: [
            { text: 'ارتفاع درجة حرارة المحرك', referToIndex: null, statment: 'عند ارتفاع درجة حرارة المحرك فجأة، يجب على الفور اخذ المسار الأيمن من الطريق والتوقف بالسيارة في مكان أمن من جانب الطريق، وعلى الفور يتم إيقاف تشغيل المحرك عن الدوران، بعد ذلك يفتح غطاء المحرك (الكبوت) بحذر ويلاحظ الأتي:- وجود آي تسرب للمياه بدورة التبريد والعمل على منعها أو إصلاح وتغير ما يلزم، التأكد من سلامة تشغيل مروحة التبريد، وبعد أن يبرد المحرك يمكن فتح غطاء الردياتير والتأكد من وجود مياه بداخله، كذلك التأكد من سلامة قربة مياه الرديتير وأن يكون بداخلها مياه حتى المستوى المطلوب،التأكد من سلامة غطاء الردياتير، التأكد من سلامة الردياتير نفسه وعدم وجود أي شيء يحجب الهواء عنه.' },
            { text: 'المحرك لا تصل درجة حرارته لدرجة الحرارة العادية', referToIndex: null, statment: 'عدم ضبط الترمستات أو عدم توافقه مع مدى درجة الحرارة المطلوبة للمحرك "غير الترموستات بآخر له المواصفات الصحيحة", تلف وحدة الاحساس بالحرارة الموجودة بالردياتير "غير عضو الاحساس بالحرارة بآخر سليم", عداد الحرارة أو مبينة الحرارة في السيارة "غير المبينة بأخرى سليمة". ' },
            { text: 'المحرك يسخن بطريقة غير عادية', referToIndex: null, statment: 'نقص مستوى المياه في الردياتير "زود مستوى المياه", عدم ضبط شد سير المروحة "اضبط شد السير", تلف الوصلات المطاط الخاصة بالمياه "غير الوصلات التالفة", تلف غطاء الردياتير العلوي "غير الغطاء", وجود سدد في مجرى المياه في دورة التبريد "اغسل دورة التبريد للتخلص من الشوائب", تلف الترموستات "غير الترموستات", عدم ضبط توقيت الاشعال "أعد ضبط توقيت الاشعال", تلف أو تسرب مياه من طلمبة المياه "اصلح أو غير طلمبة المياه", تلف خرطوم المياه الموصل "اختبر الوصلات وغير التالف منها", لابد من اللجوء إلى كهربائي متخصص تلف المروحة الكهربائية التي تعمل بواسطة وحدة ارسال من الردياتير' },
        ]
    },
    // index 32, 33
    {
        index: 31,
        text: 'الاقتراحات المتاحة ....\n- رائحة بنزين اثناء السير\n- صدور صوت من جهة المحرك\n- اللون الخارج من عادم المحرك او الشكمان\n- شيء اخر',
        choices: [
            { text: 'رائحة بنزين اثناء السير', referToIndex: null, statment: 'عند وجود شكوى متكررة من شم رائحة بنزين أثناء السير بالسيارة. يجب التأكد أولاً من عدم وجود تسريب للبنزين من دورة الوقود، ثم التأكد من الضبط الصحيح للمحرك وخاصة على السرعات العالية، ثم عدم وجود تنفيس للعادم من الشكمان، ثم التأكد من الإحكام الجيد لهوايات الداخلية للشنطة الخلفية للسيارة أو انسداد بماسورة تهوية التانكي في بعض السيارات' },
            { text: 'صدور صوت من جهة المحرك', referToIndex: 32, statment: null },
            { text: 'اللون الخارج من عادم المحرك او الشكمان', referToIndex: null, statment: 'في ظروف التشغيل العادية المفروض أن غازات العادم تخرج من الشكمان بدون لون، ولكن هناك ثلاثة أنواع من غازات العادم تخرج من شكمان السيارة في حالات معينة كل منها له لون مختلف عن الآخر، ومن خلاله يمكن تشخيص حالة المحرك:\nإذا كان لون العادم ((أبيض مستمر))مع حالات التشغيل العادية وفي جميع الظروف، فهذا دليل على أن هناك تسرب لمياه التبريد إلى غرفة الاحتراق وتخترق معه\nوإذا كان لون العادم ((اسود او رمادي اقرب للسواد)) فهذا دليل على احتراق كمية كبيرة من الوقود في غرفة الاحتراق مما يدل علىاحتياج الكرباريتر او البخاخات للضبط ً (ضبط الوقود مع الهواء)\nوإذا كان لون العادم ((أزرق سماوي))فذلك دليل على أن هناك احتراق لزيت التزييت في غرفة الاحتراق، وهو دل على احتياجالمحرك للإصلاح.' },
            { text: 'شيء اخر', referToIndex: 33, statment: null },
        ]
    },
    {
        index: 32,
        text: 'الاقتراحات المتاحة ....\n- صوت نقر ضعيف في أعلى المحرك\n- صوت تنفيس من المحرك\n- أسباب سماع طقطقة في دورات المحرك\n- صدور أصوات من الدينامو',
        choices: [
            { text: 'صوت نقر ضعيف في أعلى المحرك', referToIndex: null, statment: 'قد يكون السبب عدم ضبط خلوصات التاكيهات "اضبط التاكيهات"، إذا استمر صوت النقر حتى بعد ضبط الخلوص أعهد بالسيارة إلى ورشة متخصصة لوجود تآكل في الكامات أو دليل الكامات أو الأذرع المتأرجحه' },
            { text: 'صوت تنفيس من المحرك', referToIndex: null, statment: 'تسرب غازات الشكمان من الفلانشة العلوية من فرن الشكان أعد رباط الشكمان أو غيره إذا لزم الأمر' },
            { text: 'أسباب سماع طقطقة في دورات المحرك', referToIndex: null, statment: 'مشكلة في الصمامات (Les Soupapes) الخاصة بالعادم أو بإدخال الهواء، و عادة ما تتسبب في سماع صوت طقطقة مسموعة. كما يمكن أن يكون المشكلة أيضآ من الغماز الهيدروليكي (Poussoir hydraulique) و هذه الأخيرة دورها هو الموافقة بين أعمدة الكامات (Arbres à cames) و الصمامات، إذ تضغط أعمدة الكامات على الغماز الهيدروليكي و الذي بدوره يضغط على الصمام لكي يفتح. عادة تطلق الغمازات أصوات طقطقة عندما يكون المحرك في حالة باردة أي في الصباح الباكر مثلآ، لكن إن كان الصوت مستمر حتى بعد تسخين المحرك، فالمشكلة راجع من الغمازات.' },
            { text: 'صدور أصوات من الدينامو', referToIndex: null, statment: 'السبب قد يكون عدم احكام ربط الدينامو في الجسم أو طارة الدينامو "اختبر تربيط الدينامو والطارة واحكم الرباط"، تآكل رولمان بلي الدينامو"غير رولمان البلي التالف"، في حالة وجود مولد ذو تيار متردد فإن أي خطأ في الشحن يؤدي لتلف المولد بسهولة لذا فإن أي عطل خارج عن عدم شد سير الدينامو أو فك أحد التوصيلات الخارجية أو قطع سير الدينامو يجب أن يعهـد بهــا لورشة متخصصة ' },
        ]
    },
    // index 34, 35
    {
        index: 33,
        text: 'الاقتراحات المتاحة ....\n- مشكلة فى الإضاءة\n- إضاءة لمبة البطارية بالتابلوة\n- أنوار لوحة العداد لا تعمل\n- شيء اخر',
        choices: [
            { text: 'مشكلة فى الإضاءة', referToIndex: 34, statment: null },
            { text: 'إضاءة لمبة البطارية بالتابلوة', referToIndex: null, statment: 'عند إضاءة لمبة البطارية بالتابلوة مع تشغيل السيارة وتظل مضاءة حتى بعد تشغيل المحرك، فهذا يعني وجود خلل في دائرة الشحن، إما أن تكون البطارية لا تستقبل الشحن لوجود عيب داخلي بها، أو أنمنظم الشحن به عيب، أو أن الدينامو لا يعطي الفولت المطلوب لشحن البطارية بسبب عيب داخلي به، أو أن سير الدينامو مرتخي وغير مشدود أو مقطوع، في هذه الحالة يجب التوقف بالسيارة و البحث عن سبب العيب، والأفضل الذهاب بالسيارة لأقرب كهربائي سيارات' },
            { text: 'أنوار لوحة العداد لا تعمل', referToIndex: null, statment: 'قد يكون السبب ناتج عن وجود رخاوة في اتصال الفيش الخاصة بالطبلون والفيش المتصلة بقاعدة الفيوزات والريليات , مع فحص اي سويتش متعلق بالطبلون مثل سويتش تحديد قوة اضاءة الطبلون , والتاكد من عدم وجود التماس في ظفيرة السيارة وفحص تأريض السيارة بشكل جيد' },
            { text: 'شيء اخر', referToIndex: 35, statment: null },
        ]
    },
    {
        index: 34,
        text: 'الاقتراحات المتاحة ....\n- عدم إضاءة جميع مصابيح السيارة\n- ضعف أستضاءة أحد اوزوج الفوانيس الأمامية\n- جانب واحد من المصابيح الخلفية والجانبية لا يعمل مع صلاحية الإشارة ونور تحذير الفرامل\n- كل الأنوار تخفت عند الوقوف وعند السرعات البطيئة\n- كل الأنوار تخفت حتى مع كون المحرك مسرعاً',
        choices: [
            { text: 'عدم إضاءة جميع مصابيح السيارة', referToIndex: null, statment: 'نظف أقطاب البطارية وأعد ربطها، رداءة التوصيل بالبطارية، اختبر وأحكم رباط الوصلات غير المحكمة، غير أو أعد شحن البطارية، تلف البطارية تماماً أو فراغها تماماً.' },
            { text: 'ضعف أستضاءة أحد اوزوج الفوانيس الأمامية', referToIndex: null, statment: 'اشحن أو غير البطارية، أعد شد سير المروحة ، وجود عيب في توصيلات الأسلاك.' },
            { text: 'جانب واحد من المصابيح الخلفية والجانبية لا يعمل مع صلاحية الإشارة ونور تحذير الفرامل', referToIndex: null, statment: 'تلف المنصهر الخاص بالمصباح أو الجهاز التكميلي،  تلف المعدة التكميلية ذاتها، صلح أو غير المفتاح التالف.' },
            { text: 'كل الأنوار تخفت عند الوقوف وعند السرعات البطيئة', referToIndex: null, statment: 'ضعف البطارية "اشحن أو استبدل البطارية"، ارتخاء سير الدينامو "شد السير"، ضعف خرج الدينامو "أعد ضبط كتاوت الدينامو".' },
            { text: 'كل الأنوار تخفت حتى مع كون المحرك مسرعاً', referToIndex: null, statment: 'زيادة اسوداد أو تفحم المصابيح "غير المصابيح المتفحمة"، ضعف توصيل الأرضي "نظف ووصل الأرضي بإحكام"، غير الفوانيس المعتمة، اختبر وأصلح عيوب الأسلاك، صدأ عاكس الفانوس وعتامته.' },
        ]
    },
    // index 36
    {
        index: 35,
        text: 'الاقتراحات المتاحة ....\n- تذبذب شحن الدينامو\n- عدم شحن البطارية\n- إنخفاض مستوى السيارة\n- شيء اخر',
        choices: [
            { text: 'تذبذب شحن الدينامو', referToIndex: null, statment: 'تأكد من جودة توصيل أرضي الكتاوت، غير أو أعد ضبط كتاوت الدينامو، عيب في كتاوت الدينامو أو ضعف توصيل الأرضي ويظهر ذلك في تذبذب استضاءة الأنوار أو تذبذب مؤشر مبين الشحن.' },
            { text: 'عدم شحن البطارية', referToIndex: null, statment: 'انزع الفرش وغير التالف منه ، أو نظفها وأعد تركيبها حشر الفرش بالمولد إذا دل لون الياي على زيادة سخونته غير الياي ضعف ياي الضغط على الفرش نظف بقطعة قماش مبللة بالبنزين اى قذارة أو رواسب على مجمع الدينامو " الكلكتور "، أعهد به لكهربائي متخصص لإصلاح عطل وجود عطل في أسلاك الدينامو الداخلية .' },
            { text: 'إنخفاض مستوى السيارة', referToIndex: 36, statment: null },
            { text: 'شيء اخر', referToIndex: null, statment: 'عفوا لم نستطع تحديد المشكلة' },

        ]
    },
    {
        index: 36,
        text: 'الاقتراحات المتاحة ....\n- رفع مستوى السيارة على الأرض\n- السيارة منخفضة من الأمام',
        choices: [
            { text: 'رفع مستوى السيارة على الأرض', referToIndex: null, statment: 'إن كنت تشتكي من انخفاض مستوى السيارة على الأرض، مع التأكد من سلامة المساعدات والسوست او اليايات فأتجه فوراً إلى إحدى المراكز المتخصصة المعتمدة وأسأل عن إمكانية رفع مستوى السيارة عن الأرض، ولا تأخذ بنصيحة أحد بوضع عليَّات أو كعكات على السوستمن أسفل ومن أعلى، لأنها فعلاً سترفع من مستوى السيارة عن الأرض ولكنها ستؤدي إلى تلف المساعدات وتسبب خشونة في المطبات أثناء السير.' },
            { text: 'السيارة منخفضة من الأمام', referToIndex: null, statment: 'اضبط نفخ الاطارات، كسر أحد اليايات، ضعف أحد اليايات، ضعف مساعد السوستة الأمامي.' },
        ]
    },
]

export default questions